InformationRegisters/НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПлательщикСтраховыхВзносовПФР_ФФОМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиСистемыНалогообложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>НастройкиСистемыНалогообложения</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СистемаНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СистемыНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПереходаНаУСН</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УведомлениеНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УведомлениеДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяетсяУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикНалогаНаПрибыль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикНДФЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикЕНВД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяетсяУСНПатент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяетсяОсобыйПорядокНалогообложения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяетсяУСНДоходы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяетсяУСНДоходыМинусРасходы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектНалогообложенияУСН</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбъектыНалогообложенияПоУСН</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикТорговогоСбора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяетсяНалогНаПрофессиональныйДоход</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЮридическоеФизическоеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ЮридическоеФизическоеЛицо</Name>
			<Comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Устанавливает значения регистра по умолчанию
//
// Параметры:
//   Запись - РегистрСведенийЗапись
//   ДанныеЗаполнения - Структура - где ключ - имя ресурса
//
Процедура УстановкаНастроекПоУмолчанию(Запись, ДанныеЗаполнения) Экспорт
	
	НастройкиУчета.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"Период",
		ТекущаяДатаСеанса());
	
	НастройкиУчета.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"Организация",
		БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация"));
		
	ЭтоЮрЛицо = ОбщегоНазначенияБПВызовСервераПовтИсп.ЭтоЮрЛицо(Запись.Организация);
		
	Если ЭтоЮрЛицо Тогда
		Запись.Организация = Справочники.Организации.ПустаяСсылка();
		Возврат;
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("ПрименяетсяНалогНаПрофессиональныйДоход") Тогда
		ПлательщикСтраховыхВзносовПФР_ФФОМС = Не ДанныеЗаполнения.ПрименяетсяНалогНаПрофессиональныйДоход;
	Иначе
		ПлательщикСтраховыхВзносовПФР_ФФОМС = Истина;
	КонецЕсли;
	
	НастройкиУчета.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"ПлательщикСтраховыхВзносовПФР_ФФОМС",
		ПлательщикСтраховыхВзносовПФР_ФФОМС);
	
КонецПроцедуры

// Возвращает интервалы, в течение которых ИП не оплачивает страховые взносы в ПФР и ФФОМС
//
// Параметры:
//  Организация - СправочникСсылка.Организация
//  ДатаНачала - Дата
//  ДатаОкончания - Дата
//
// Возвращаемое значение:
//  ТаблицаЗначений:
//   * ДатаНачала - Дата
//   * ДатаОкончания - Дата
//
Функция ИнтервалыИПНеОплачиваетСтраховыеВзносы(Организация, ДатаНачала, ДатаОкончания) Экспорт
	
	Интервалы = Новый ТаблицаЗначений;
	ТипДата = ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата);
	Интервалы.Колонки.Добавить("ДатаНачала", ТипДата);
	Интервалы.Колонки.Добавить("ДатаОкончания", ТипДата);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМССрезПоследних.Период КАК Период,
		|	НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМССрезПоследних.ПлательщикСтраховыхВзносовПФР_ФФОМС КАК ПлательщикСтраховыхВзносовПФР_ФФОМС
		|ИЗ
		|	РегистрСведений.НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.СрезПоследних(&ДатаНачала, Организация = &Организация) КАК НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМССрезПоследних
		|ГДЕ
		|	НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМССрезПоследних.Период < &ДатаНачала
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.Период,
		|	НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.ПлательщикСтраховыхВзносовПФР_ФФОМС
		|ИЗ
		|	РегистрСведений.НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС КАК НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС
		|ГДЕ
		|	НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.Организация = &Организация
		|	И НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПредыдущаяСтрока = Неопределено;
	Пока Выборка.Следующий() Цикл
		Если Выборка.ПлательщикСтраховыхВзносовПФР_ФФОМС И ПредыдущаяСтрока = Неопределено Тогда
			Продолжить;
		ИначеЕсли Выборка.ПлательщикСтраховыхВзносовПФР_ФФОМС И Не ЗначениеЗаполнено(ПредыдущаяСтрока.ДатаОкончания) Тогда
			ПредыдущаяСтрока.ДатаОкончания = НачалоДня(Выборка.Период) - 1;
		Иначе
			НоваяСтрока = Интервалы.Добавить();
			НоваяСтрока.ДатаНачала = ?(Выборка.Период < ДатаНачала, ДатаНачала, Выборка.Период);
			Если ПредыдущаяСтрока <> Неопределено И Не ЗначениеЗаполнено(ПредыдущаяСтрока.ДатаОкончания) Тогда
				ПредыдущаяСтрока.ДатаОкончания = НачалоДня(Выборка.Период) - 1;
			КонецЕсли;
			ПредыдущаяСтрока = НоваяСтрока;
		КонецЕсли;
	КонецЦикла;
	
	Если ПредыдущаяСтрока <> Неопределено И Не ЗначениеЗаполнено(ПредыдущаяСтрока.ДатаОкончания) Тогда
		ПредыдущаяСтрока.ДатаОкончания = ДатаОкончания;
	КонецЕсли;
	
	Возврат Интервалы;
	
КонецФункции

// Добавляет в регистр сведений "НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС" новые записи, если
// значение ресурса "ПлательщикСтраховыхВзносовПФР_ФФОМС" поменялось. Это может произойти при изменении
// системы налогообложения ИП, снятии ИП с регистрации и обратной постановки ИП на учет
//
// Параметры:
//  НастройкиПлатежейСтраховыхВзносов - ТаблицаЗначений - см. НовыеНастройкиУчетаСтраховыхВзносов_ПФР_ФФОМС
//
Процедура ОтразитьИзменениеНастройкиПлательщикСтраховыхВзносов(НастройкиПлатежейСтраховыхВзносов) Экспорт
	
	Если НастройкиПлатежейСтраховыхВзносов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Через параметр в запрос передаем новые настройки системы налогообложения, выбираем записи из предыдущей настройки
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиУчетаСтраховыхВзносов.Организация КАК Организация,
		|	НастройкиУчетаСтраховыхВзносов.Период КАК Период,
		|	НастройкиУчетаСтраховыхВзносов.ПлательщикНПД КАК ПлательщикНПД,
		|	НастройкиУчетаСтраховыхВзносов.ДатаИзменения КАК ДатаИзменения
		|ПОМЕСТИТЬ ВТ_ИзменяемыеДанные
		|ИЗ
		|	&НастройкиУчетаСтраховыхВзносов КАК НастройкиУчетаСтраховыхВзносов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИзменяемыеДанные.Организация КАК Организация,
		|	ВТ_ИзменяемыеДанные.Период КАК Период,
		|	ВТ_ИзменяемыеДанные.ПлательщикНПД КАК ПлательщикНПД,
		|	ВТ_ИзменяемыеДанные.ДатаИзменения КАК ДатаИзменения,
		|	МАКСИМУМ(ЕСТЬNULL(НастройкиСистемыНалогообложения.Период, ВТ_ИзменяемыеДанные.Период)) КАК ПериодНастроекСистемыНалогообложения,
		|	МАКСИМУМ(ЕСТЬNULL(НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.Период, ВТ_ИзменяемыеДанные.ДатаИзменения)) КАК ПериодНастроекУчетаСтраховыхВзносов
		|ПОМЕСТИТЬ ПериодыНастроек
		|ИЗ
		|	ВТ_ИзменяемыеДанные КАК ВТ_ИзменяемыеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиСистемыНалогообложения КАК НастройкиСистемыНалогообложения
		|		ПО ВТ_ИзменяемыеДанные.Организация = НастройкиСистемыНалогообложения.Организация
		|			И ВТ_ИзменяемыеДанные.Период >= НастройкиСистемыНалогообложения.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС КАК НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС
		|		ПО ВТ_ИзменяемыеДанные.Организация = НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.Организация
		|			И ВТ_ИзменяемыеДанные.ДатаИзменения >= НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИзменяемыеДанные.Организация,
		|	ВТ_ИзменяемыеДанные.Период,
		|	ВТ_ИзменяемыеДанные.ПлательщикНПД,
		|	ВТ_ИзменяемыеДанные.ДатаИзменения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПериодыНастроек.Организация КАК Организация,
		|	ПериодыНастроек.ПлательщикНПД КАК ПлательщикНПД,
		|	ПериодыНастроек.ДатаИзменения КАК ДатаИзменения,
		|	ЕСТЬNULL(НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.ПлательщикСтраховыхВзносовПФР_ФФОМС, НЕОПРЕДЕЛЕНО) КАК ПлательщикСтраховыхВзносов
		|ИЗ
		|	ПериодыНастроек КАК ПериодыНастроек
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиСистемыНалогообложения КАК НастройкиСистемыНалогообложения
		|		ПО ПериодыНастроек.Организация = НастройкиСистемыНалогообложения.Организация
		|			И ПериодыНастроек.ПериодНастроекСистемыНалогообложения = НастройкиСистемыНалогообложения.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС КАК НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС
		|		ПО ПериодыНастроек.Организация = НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.Организация
		|			И ПериодыНастроек.ПериодНастроекУчетаСтраховыхВзносов = НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.Период";
	
	Запрос.Параметры.Вставить("НастройкиУчетаСтраховыхВзносов", НастройкиПлатежейСтраховыхВзносов);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		// Проверяем, нужно ли изменить настройку плательщика страховых взносов
		// Выборка.ПлательщикСтраховыхВзносов - значение настройки на настоящий момент времени
		// Выборка.ПлательщикНПД - новое значение системы налогообложения
		// Соответственно, если ИП стал плательщиком НПД (не платит взносы), а ранее платил страховые взносы,
		// значит нужно добавить новую запись, с отключенным признаком плательщика и т.д.
		ПризнакПлательщикСтраховыхВзносов = Неопределено;
		Если Выборка.ПлательщикСтраховыхВзносов = Неопределено Тогда
			ПризнакПлательщикСтраховыхВзносов = Не Выборка.ПлательщикНПД;
		ИначеЕсли Выборка.ПлательщикНПД И Выборка.ПлательщикСтраховыхВзносов Тогда
			ПризнакПлательщикСтраховыхВзносов = Ложь;
		ИначеЕсли Не Выборка.ПлательщикНПД И Не Выборка.ПлательщикСтраховыхВзносов Тогда
			ПризнакПлательщикСтраховыхВзносов = Истина;
		КонецЕсли;
		Если ПризнакПлательщикСтраховыхВзносов <> Неопределено Тогда
			МенеджерЗаписи = РегистрыСведений.НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Организация = Выборка.Организация;
			МенеджерЗаписи.Период = Выборка.ДатаИзменения;
			МенеджерЗаписи.ПлательщикСтраховыхВзносовПФР_ФФОМС = ПризнакПлательщикСтраховыхВзносов;
			МенеджерЗаписи.Записать(Истина);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Находит и удаляет запись регистра "НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС", соответствующую
// удаляемой записи регистра "НастройкиСистемыНалогообложения", которая определяется по
// переданным через параметры значениям отбора
//
// Параметры:
//  Организация - СправочникСсылка.Организации
//  Период - Дата
//
Процедура ПриУдаленииЗаписиНастройкиСистемыНалогообложения(Организация, Период) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкиСистемыНалогообложения.ДатаИзменения КАК ДатаИзменения,
		|	НастройкиСистемыНалогообложения.Организация КАК Организация
		|ПОМЕСТИТЬ ВТ_ПараметрыУдаляемойЗаписи
		|ИЗ
		|	РегистрСведений.НастройкиСистемыНалогообложения КАК НастройкиСистемыНалогообложения
		|ГДЕ
		|	НастройкиСистемыНалогообложения.Организация = &Организация
		|	И НастройкиСистемыНалогообложения.Период = &Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.Организация КАК Организация,
		|	НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.Период КАК Период
		|ИЗ
		|	ВТ_ПараметрыУдаляемойЗаписи КАК ВТ_ПараметрыУдаляемойЗаписи
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС КАК НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС
		|		ПО ВТ_ПараметрыУдаляемойЗаписи.Организация = НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.Организация
		|			И ВТ_ПараметрыУдаляемойЗаписи.ДатаИзменения = НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.Период";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Период);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		МенеджерЗаписи = РегистрыСведений.НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Организация = Выборка.Организация;
		МенеджерЗаписи.Период = Выборка.Период;
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Удалить();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Создает новые записи в регистре "НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС"
// при обновлении информационной базы
//
Процедура ЗаполнитьРегистр() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.Организация КАК Организация
		|ПОМЕСТИТЬ ВТ_ОрганизацииВСуществующихЗаписях
		|ИЗ
		|	РегистрСведений.НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС КАК НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА НастройкиСистемыНалогообложения.ДатаИзменения = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА НастройкиСистемыНалогообложения.Период
		|		ИНАЧЕ НастройкиСистемыНалогообложения.ДатаИзменения
		|	КОНЕЦ КАК ДатаИзменения,
		|	Организации.Ссылка КАК Организация,
		|	ЕСТЬNULL(НастройкиСистемыНалогообложения.ПрименяетсяНалогНаПрофессиональныйДоход, ЛОЖЬ) КАК ПрименяетсяНалогНаПрофессиональныйДоход,
		|	ВЫБОР
		|		КОГДА НастройкиСистемыНалогообложения.СистемаНалогообложения ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК СистемаНалогообложенияНайдена,
		|	НастройкиСистемыНалогообложения.Период КАК Период
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиСистемыНалогообложения КАК НастройкиСистемыНалогообложения
		|		ПО (НастройкиСистемыНалогообложения.Организация = Организации.Ссылка)
		|ГДЕ
		|	НЕ Организации.Ссылка В
		|				(ВЫБРАТЬ
		|					ВТ_ОрганизацииВСуществующихЗаписях.Организация КАК Организация
		|				ИЗ
		|					ВТ_ОрганизацииВСуществующихЗаписях КАК ВТ_ОрганизацииВСуществующихЗаписях)
		|	И Организации.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация,
		|	Период
		|ИТОГИ ПО
		|	Организация";
	
	ВыборкаОрганизация = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаОрганизация.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(ВыборкаОрганизация.Организация);
		Выборка = ВыборкаОрганизация.Выбрать();
		ПерваяЗапись = Истина;
		ПлательщикСтраховыхВзносов = Истина;
		Пока Выборка.Следующий() Цикл
			ТребуетсяДобавитьЗапись = ПерваяЗапись Или
				(Выборка.СистемаНалогообложенияНайдена И ПлательщикСтраховыхВзносов = Выборка.ПрименяетсяНалогНаПрофессиональныйДоход);
			Если Не ТребуетсяДобавитьЗапись Тогда
				Продолжить;
			КонецЕсли;
			Запись = НаборЗаписей.Добавить();
			Если Выборка.СистемаНалогообложенияНайдена Тогда
				Запись.Организация = Выборка.Организация;
				Запись.Период = ?(ПерваяЗапись, Выборка.Период, Выборка.ДатаИзменения);
				Запись.ПлательщикСтраховыхВзносовПФР_ФФОМС = Не Выборка.ПрименяетсяНалогНаПрофессиональныйДоход;
			Иначе
				ДанныеЗаполнения = Новый Структура;
				ДанныеЗаполнения.Вставить("Организация", Выборка.Организация);
				УстановкаНастроекПоУмолчанию(Запись, ДанныеЗаполнения);
			КонецЕсли;
			ПлательщикСтраховыхВзносов = Запись.ПлательщикСтраховыхВзносовПФР_ФФОМС;
			ПерваяЗапись = Ложь;
		КонецЦикла;
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	КонецЦикла;
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК ЭтотСписок
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК ОбособленныеПодразделения 
	|	ПО ОбособленныеПодразделения.ГоловнаяОрганизация = ЭтотСписок.Организация.ГоловнаяОрганизация
	|;
	|РазрешитьЧтение
	|ГДЕ
	| ЗначениеРазрешено(ОбособленныеПодразделения.Ссылка)
	|
	|;
	|РазрешитьИзменениеЕслиРазрешеноЧтение
	|ГДЕ
	| ЗначениеРазрешено(ЭтотСписок.Организация)";
	
КонецПроцедуры

Функция НовыеНастройкиУчетаСтраховыхВзносов_ПФР_ФФОМС() Экспорт
	
	НастройкиУчетаСтраховыхВзносов = Новый ТаблицаЗначений;
	ОписаниеТипаДата = ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата);
	НастройкиУчетаСтраховыхВзносов.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	НастройкиУчетаСтраховыхВзносов.Колонки.Добавить("Период", ОписаниеТипаДата);
	НастройкиУчетаСтраховыхВзносов.Колонки.Добавить("ДатаИзменения", ОписаниеТипаДата);
	НастройкиУчетаСтраховыхВзносов.Колонки.Добавить("ПлательщикНПД", Новый ОписаниеТипов("Булево"));
	Возврат НастройкиУчетаСтраховыхВзносов;
	
КонецФункции

#КонецОбласти

#КонецЕсли
